# Bria Stalker
## WK12 04/06/21
### Python Pandas Series

In [1]:
import numpy as np

from pandas import Series,DataFrame
import pandas as pd

In [2]:
s = Series([2,5,7,-9,8,4])

s

0    2
1    5
2    7
3   -9
4    8
5    4
dtype: int64

In [3]:
s.values

array([ 2,  5,  7, -9,  8,  4], dtype=int64)

In [4]:
s.index

RangeIndex(start=0, stop=6, step=1)

In [5]:
# values and index
summer_olympic = Series([2520,1122,937,847,713],index=['USA','Russia','Germany','UK','France'])
summer_olympic

USA        2520
Russia     1122
Germany     937
UK          847
France      713
dtype: int64

In [6]:
summer_olympic['USA']

2520

In [7]:
summer_olympic[summer_olympic > 800]

USA        2520
Russia     1122
Germany     937
UK          847
dtype: int64

In [8]:
'USA' in summer_olympic

True

In [9]:
'Italy' in summer_olympic

False

In [10]:
summer_olympic_dict = summer_olympic.to_dict()#convert series to dictionary

In [11]:
summer_olympic_dict

{'USA': 2520, 'Russia': 1122, 'Germany': 937, 'UK': 847, 'France': 713}

In [12]:
#convert dictionary to series
summer_olympic_series = Series(summer_olympic_dict)

In [13]:
summer_olympic_series

USA        2520
Russia     1122
Germany     937
UK          847
France      713
dtype: int64

In [14]:
#Series used more than dictionaries...more functions
countries = ['USA','Russia','Germany','UK','France','Italy']

In [15]:
#redefine a series
s2 = Series(summer_olympic_dict, index=countries)

In [16]:
s2

USA        2520.0
Russia     1122.0
Germany     937.0
UK          847.0
France      713.0
Italy         NaN
dtype: float64

In [17]:
pd.isnull(s2) #check for null values

USA        False
Russia     False
Germany    False
UK         False
France     False
Italy       True
dtype: bool

In [18]:
pd.notnull(s2) #Check for not null values

USA         True
Russia      True
Germany     True
UK          True
France      True
Italy      False
dtype: bool

In [19]:
summer_olympic_series + s2 #match series by index

France     1426.0
Germany    1874.0
Italy         NaN
Russia     2244.0
UK         1694.0
USA        5040.0
dtype: float64

In [20]:
s2.name="Summer Olympic"
s2

USA        2520.0
Russia     1122.0
Germany     937.0
UK          847.0
France      713.0
Italy         NaN
Name: Summer Olympic, dtype: float64

In [21]:
s2.index.name='Countries'

In [22]:
s2

Countries
USA        2520.0
Russia     1122.0
Germany     937.0
UK          847.0
France      713.0
Italy         NaN
Name: Summer Olympic, dtype: float64

In [23]:
#DataFrame
data_dictionary = {'States':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],'Year':[2000,2001,2002,2001,2002,2003],'Pop':[1.5,1.7,3.6,2.4,2.9,3.2]}

df = pd.DataFrame(data_dictionary)
df

   States  Year  Pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [24]:
df.head() #gives 0-4

   States  Year  Pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [25]:
df.tail() #gives 1-5

   States  Year  Pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [26]:
pd.DataFrame(data_dictionary, columns=['Year','States','Pop'])

   Year  States  Pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [27]:
df2 = pd.DataFrame(data_dictionary, columns=['Year','States','Pop','Debt'],index = ['one','two','three','four','five','six'])

In [28]:
df2

       Year  States  Pop Debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [29]:
df2.columns #check number of columns

Index(['Year', 'States', 'Pop', 'Debt'], dtype='object')

In [30]:
df2['States']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: States, dtype: object

In [31]:
df2.Year #this is cap sensitive

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: Year, dtype: int64

In [32]:
df2.loc['three'] #gives info at index 3

Year      2002
States    Ohio
Pop        3.6
Debt       NaN
Name: three, dtype: object

In [33]:
df2['Debt']= 10.5

In [34]:
df2

       Year  States  Pop  Debt
one    2000    Ohio  1.5  10.5
two    2001    Ohio  1.7  10.5
three  2002    Ohio  3.6  10.5
four   2001  Nevada  2.4  10.5
five   2002  Nevada  2.9  10.5
six    2003  Nevada  3.2  10.5

In [35]:
df2['Debt']= np.arange(6.) #. makes it float point number
df2

       Year  States  Pop  Debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [36]:
s3 = pd.Series([-1.2,-1.5,-1.7], index=['two','four','five'])

In [37]:
s3

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [38]:
df2['Debt']= s3 #missing data is filled with null
df2

       Year  States  Pop  Debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [39]:
df2['Eastern'] = df2['States'] == 'Ohio'
df2

       Year  States  Pop  Debt  Eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [40]:
df2.columns

Index(['Year', 'States', 'Pop', 'Debt', 'Eastern'], dtype='object')

In [52]:
#delete column
del df2['Eastern']

KeyError: 'Eastern'

In [41]:
#nested dictionary
pop_dict = {'Nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [42]:
pop_dict

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [43]:
df3 = pd.DataFrame(pop_dict) #puts it in nice formatdf3.T

df3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [44]:
df3.T #transpose..flip rows and columns

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [45]:
DataFrame(df3,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [46]:
df3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [47]:
df3['Ohio'][:-1]

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [48]:
df3['Nevada'][:1]

2001    2.4
Name: Nevada, dtype: float64

In [55]:
#set index and columns name attributes
df3.index.name='year';df3.columns.name = 'state'
df3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5